Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  FINAL MODEL HANDLE – FULLY UPDATED (2025)
 *  Supports:
 *    - Timer (5 Slots) with DayMask + Enabled
 *    - Semi-Auto, Auto, Countdown, Twist, Manual
 *    - Soft Dry-Run FSM
 *    - DS1307 DOW (1–7 → Mon–Sun)
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/***************************************************************
 *  EXTERNAL MODULE VARIABLES
 ***************************************************************/
extern ADC_Data adcData;
extern RTC_Time_t time;
TimerSlot timerSlots[5] = {0};

/***************************************************************
 *  GLOBAL MODE FLAGS
 ***************************************************************/
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/***************************************************************
 *  MOTOR STATUS (0 = OFF, 1 = ON)
 ***************************************************************/
volatile uint8_t motorStatus = 0;

/***************************************************************
 *  SAFETY FLAGS
 ***************************************************************/
volatile bool senseDryRun         = false;   // TRUE = WATER PRESENT
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;
// USER CONFIGURABLE SETTINGS (persistent)
static uint16_t user_gap_s        = 10;     // Default
static uint8_t  user_retry_count  = 3;
static uint16_t user_uv_limit     = 180;
static uint16_t user_ov_limit     = 260;
static float    user_overload     = 6.5f;
static float    user_underload    = 0.5f;
static uint16_t user_maxrun_min   = 120;

uint16_t sys_gap_time_s;
uint8_t  sys_retry_count;

uint16_t sys_uv_limit;
uint16_t sys_ov_limit;

float sys_overload_limit;
float sys_underload_limit;

uint16_t sys_maxrun_min;

/***************************************************************
 *  MANUAL OVERRIDE FLAG
 ***************************************************************/
volatile bool manualOverride = false;

/***************************************************************
 *  INTERNAL UTILITY
 ***************************************************************/
static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
uint16_t ModelHandle_GetGapTime(void) {
    return user_gap_s;
}

uint8_t ModelHandle_GetRetryCount(void) {
    return user_retry_count;
}

uint16_t ModelHandle_GetUnderVolt(void) {
    return user_uv_limit;
}

uint16_t ModelHandle_GetOverVolt(void) {
    return user_ov_limit;
}

float ModelHandle_GetOverloadLimit(void) {
    return user_overload;
}

float ModelHandle_GetUnderloadLimit(void) {
    return user_underload;
}

uint16_t ModelHandle_GetMaxRunTime(void) {
    return user_maxrun_min;
}
void ModelHandle_SetUserSettings(
    uint16_t gap_s,
    uint8_t retry,
    uint16_t uv,
    uint16_t ov,
    float overload,
    float underload,
    uint16_t maxrun_min
){
    user_gap_s = gap_s;
    user_retry_count = retry;
    user_uv_limit = uv;
    user_ov_limit = ov;
    user_overload = overload;
    user_underload = underload;
    user_maxrun_min = maxrun_min;

    // Optional: Save to EEPROM here later
}
void ModelHandle_FactoryReset(void)
{
    user_gap_s       = 10;
    user_retry_count = 3;
    user_uv_limit    = 180;
    user_ov_limit    = 260;
    user_overload    = 6.5f;
    user_underload   = 0.5f;
    user_maxrun_min  = 120;

    // Optional: EEPROM_SaveDefaults();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
}

/***************************************************************
 *  MOTOR CONTROL (ANTI-CHATTER)
 ***************************************************************/
static inline void motor_apply(bool on)
{
    if (on == Motor_GetStatus())
        return;

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

bool Motor_GetStatus(void)
{
    return (motorStatus == 1);
}

/***************************************************************
 *  MANUAL MODE CONTROL
 ***************************************************************/
void ModelHandle_SetMotor(bool on)
{
    clear_all_modes();
    manualOverride = true;

    /* In manual mode dry-run is disabled */
    senseDryRun = false;

    if (on) start_motor();
    else    stop_motor();
}

/* RESET pump logic (SW1 short press) */
void reset(void)
{
    if (Motor_GetStatus())
    {
        stop_motor();
        HAL_Delay(2000);
        start_motor();
    }
    else
    {
        start_motor();
        HAL_Delay(2000);
        stop_motor();
    }
}

/***************************************************************
 *  TANK FULL DETECTION
 *  (5 ADC probes = level sensors)
 ***************************************************************/

void ModelHandle_StopAllModesAndMotor(void)
{
    manualActive     = false;
    semiAutoActive   = false;
    timerActive      = false;
    countdownActive  = false;
    twistActive      = false;
    autoActive       = false;

    ModelHandle_SetMotor(false);   // turn OFF motor safely
}

static inline bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;

    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if (now - stableStart >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

