Amiya200/stm32_water_tank/Core/Src/model_handle.c
    return false;
}

/***************************************************************
 *  DRY-RUN SENSOR CHECK
 *  Voltage <=0.01f → WATER PRESENT → dry=false
 *  Voltage > 0.01f → DRY → dry=true
 ***************************************************************/
void ModelHandle_CheckDryRun(void)
{
    /* Countdown, Semi-Auto, Manual ignore dry-run */
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[0];

    if (v > 0.01f)
        senseDryRun = false;   // WATER PRESENT
    else
        senseDryRun = true;    // DRY
}
void ModelHandle_ToggleManual(void)
{
    // Stop all other modes before manual
    timerActive     = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    autoActive      = false;

    manualActive = !manualActive;

    if (manualActive)
    {
        manualOverride = true;
        start_motor();
    }
    else
    {
        manualOverride = false;
        stop_motor();
    }
}


/***************************************************************
 *  SOFT DRY-RUN FSM
 ***************************************************************/
typedef enum {
    DRY_IDLE = 0,
    DRY_PROBE,
    DRY_NORMAL
} DryFSMState;

static DryFSMState dryState = DRY_IDLE;
static bool dryConfirming   = false;

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;

#define DRY_PROBE_ON_MS      5000UL
#define DRY_PROBE_OFF_MS    10000UL
#define DRY_CONFIRM_MS       1500UL

static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            timerActive ||
            autoActive);
}

void ModelHandle_SoftDryRunHandler(void)
{
    uint32_t now = now_ms();

    /***********************************************************
     * 1) COUNTDOWN MODE → Dry-run fully bypassed
     ***********************************************************/
    if (countdownActive)
    {
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        dryConfirmStart= 0;
        return;
    }

    /***********************************************************
     * 2) Normal dry-run check
     ***********************************************************/
    ModelHandle_CheckDryRun();

    /* No active mode → motor off + reset FSM */
    if (!isAnyModeActive())
    {
        stop_motor();
        dryState       = DRY_IDLE;
        dryConfirming  = false;
        dryDeadline    = 0;
        return;
    }

    /***********************************************************
     * 3) FSM OPERATION
     ***********************************************************/
    switch (dryState)
    {
    case DRY_IDLE:
        if (senseDryRun)  // water present
        {
            start_motor();
            dryState = DRY_NORMAL;
        }
        else              // dry
        {
            if (now >= dryDeadline)
            {
                start_motor();
                dryState = DRY_PROBE;
                dryDeadline = now + DRY_PROBE_ON_MS;
            }
        }
        break;

    case DRY_PROBE:
        if (senseDryRun)   // water found
        {
            dryState = DRY_NORMAL;
        }
        else if (now >= dryDeadline)
        {
            stop_motor();
            dryState = DRY_IDLE;
            dryDeadline = now + DRY_PROBE_OFF_MS;
        }
        break;

    case DRY_NORMAL:
        if (!senseDryRun)   // DRY detected
        {
            if (!dryConfirming)
            {
                dryConfirming = true;
                dryConfirmStart = now;
            }
            else if (now - dryConfirmStart >= DRY_CONFIRM_MS)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryConfirming = false;
                dryDeadline = now + DRY_PROBE_OFF_MS;
            }
        }
        else
        {
            dryConfirming = false;
        }
        break;
    }
}

/***************************************************************
 *  LEGACY ENTRY POINT
 ***************************************************************/
void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
/***************************************************************
 * ======================== TIMER MODE =========================
 * DS1307 dow: 1=Mon to 7=Sun
 * dayMask: bit0=Mon to bit6=Sun
 ***************************************************************/

/* Convert RTC DOW into bit mask */
static inline uint8_t get_today_mask(void)
{
    uint8_t dow = time.dow;  /* valid range 1..7 */
    if (dow < 1 || dow > 7)
        dow = 1;
    return (1u << (dow - 1)); /* Mon->bit0 ... Sun->bit6 */
}

/* Check if slot active at current HH:MM */
static bool slot_is_active_now(const TimerSlot *t)
{
    if (!t->enabled)
        return false;

    /* Day match */
    uint8_t todayMask = get_today_mask();
    if ((t->dayMask & todayMask) == 0)
        return false;

    /* Time compare HH:MM only */
    uint16_t nowHM = time.hour * 60 + time.min;
    uint16_t onHM  = t->onHour * 60 + t->onMinute;
    uint16_t offHM = t->offHour * 60 + t->offMinute;

    if (onHM < offHM)
    {
        return (nowHM >= onHM && nowHM < offHM);
    }
    else
    {
        /* Overnight slot */
        return (nowHM >= onHM || nowHM < offHM);
    }
}

/* Check if ANY slot is active */
static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
    {
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    }
    return false;
}

/***************************************************************
 * Start nearest timer slot (SW3 short press)
 ***************************************************************/
void ModelHandle_StartTimerNearestSlot(void)
{
    clear_all_modes(); /* original must NOT clear timerActive */
    timerActive = true;

    RTC_GetTimeDate();

    uint16_t nowHM = time.hour * 60 + time.min;

    uint16_t bestDiff = 20000;
    int best = -1;

    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled) continue;

        uint8_t todayMask = get_today_mask();
        if (!(t->dayMask & todayMask)) continue;

